//                                  Тестирование

//                         Выберите правильный вариант ответа 
//-------------------------------------------------------------------

// 1 Сколько типов данных существует в JS?

// 7
// 5
// 6
// 4

// Ответ: 7

//---------------------------------------------------------------------

// 2 Как вывести информацию в консоль?

// print.log()
// console.log()
// alert()
// print.console()

// Ответ: console.log();

//----------------------------------------------------------------------

// 3 Какая функция операторов || и && ?

// Логические операторы ИЛИ и И
// Логические операторы И и ИЛИ
// В JS таких операторов не существует
// Операторы вычитания и сложения в JS

// Ответ: Логические операторы ИЛИ и И

//-----------------------------------------------------------------------

// 4 Сколько видов циклов существует в JS?

// 3
// 6
// 4
// 1

// Ответ: 3

//------------------------------------------------------------------------ 

// 5 Как перебрать свойства объекта?

// метод forEach
// цикл for of
// цикл while do

// Ответ: forEach

//------------------------------------------------------------------------ 

// 6 Какое будет выведено значение: let x = 5; alert(x++); ?

// 5
// number
// 6
// x++

// Ответ: 5

//------------------------------------------------------------------------- 

// 7 Чему равно такое выражение: [ ] + false - null + true ?

// NaN
// []
// false
// true

// Ответ: NaN

//-------------------------------------------------------------------------- 

// 8 Что выведет этот код: let y = 1; let x = y = 2; alert(x); ?

// x
// 2
// y
// 1

// Ответ: 2

//---------------------------------------------------------------------------

// 9 Чему равна сумма [ ] + 1 + 2 ?

// []
// Выведет ошибку
// "12"
// 12

// Ответ: "12"

//---------------------------------------------------------------------------- 

// 10 Что выведет этот код: alert( "1"[0] ) ?

// array
// Выведет ошибку
// ""
// 1

// Ответ: 1

//-------------------------------------------------------------------------------

// 11 Чему равно 2 && 1 && null && 0 && undefined ?

// 1
// null
// 3
// 0

// Ответ: null

//----------------------------------------------------------------------------------

// 12 Есть ли разница между выражениями !!( a && b ) и (a && b) ?

// Есть
// Нет
// Разница только при использовании этих выражений
// Синтаксис первого выражения неверен

// Ответ: Есть

//------------------------------------------------------------------------------------

// 13 Что выведет этот код: alert( null || 2 && 3 || 4 ); ?

// 2
// 4
// false
// 3

// Ответ: false

//--------------------------------------------------------------------------------------

// 14 Правда ли что a == b ? a = [1, 2, 3]; b = [1, 2, 3]; 

// Да
// Нет

// Ответ: Нет

//--------------------------------------------------------------------------------------

// 15 Что выведет этот код: alert( +"Infinity" ); ?

// NaN
// ""
// false
// Infinity

// Ответ: Infinity

//----------------------------------------------------------------------------------------

// 16 Верно ли сравнение: "Ёжик" > "яблоко" ?

// Да
// Нет

// Ответ: Нет

//---------------------------------------------------------------------------------------

// 17 Чему равно 0 || "" || 2 || undefined || true || falsе ?

// ""
// 2
// 0
// false

// Ответ: 2

//-----------------------------------------------------------------------------------------

// 18 Что мы получаем при помощи команды .querySelectorAll() ?

// Массив элементов
// Псевдомассив элементов (html-коллекция)
// Объект с элементами
// Первый элемент со страницы по заданному селектору

// Ответ: Псевдомассив элементов (html-коллекция)

//------------------------------------------------------------------------------------------

// 19 Как можно изменить размер шрифта элемента при помощи JS?

// element.style.font-size = "16px"
// element.style.fontSize = "16px"
// element.style = { fontSize: “16px” }
// element.fontSize = "16px

// Ответ: element.style.fontSize = "16px"

//--------------------------------------------------------------------------------------------

// 20 На какой html-элемент можно назначить обработчик события submit?

// div
// iframe
// любой элемент
// form

// Ответ: form

//---------------------------------------------------------------------------------------------